#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.secretsmanager.aws_secretsmanager_secret.EXTERNAL_SVC_API_KEYS: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:043309351324:secret:EXTERNAL_SVC_API_KEYS-DRf7c7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secretsmanager.aws_secretsmanager_secret.EXAMPLE_SECRET will be created
  + resource "aws_secretsmanager_secret" "EXAMPLE_SECRET" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "EXAMPLE_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*